In [31]:
from pymongo.mongo_client import MongoClient
import json
import pandas as pd

In [19]:
client_url="mongodb+srv://aqibansari72a:aqib7860@cluster0.1tmwbzz.mongodb.net/?retryWrites=true&w=majority"
database_name='credit_card_data'

In [20]:
client=MongoClient(client_url)

In [21]:
DATABASE_NAME='Aqib'
COLLECTION_NAME='credit_card_data'

In [30]:
df=pd.read_csv('../notebooks/creditCardFraud_28011964_120214.csv')
df.head()

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,50000,1,2,1,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0
1,50000,1,1,2,37,0,0,0,0,0,...,19394,19619,20024,2500,1815,657,1000,1000,800,0
2,500000,1,1,2,29,0,0,0,0,0,...,542653,483003,473944,55000,40000,38000,20239,13750,13770,0
3,100000,2,2,2,23,0,-1,-1,0,0,...,221,-159,567,380,601,0,581,1687,1542,0
4,140000,2,3,1,28,0,0,2,0,0,...,12211,11793,3719,3329,0,432,1000,1000,1000,0

In [32]:
json_data=list(json.loads(df.T.to_json()).values())

In [34]:
json_data[0]

{'LIMIT_BAL': 50000,
 'SEX': 1,
 'EDUCATION': 2,
 'MARRIAGE': 1,
 'AGE': 57,
 'PAY_0': -1,
 'PAY_2': 0,
 'PAY_3': -1,
 'PAY_4': 0,
 'PAY_5': 0,
 'PAY_6': 0,
 'BILL_AMT1': 8617,
 'BILL_AMT2': 5670,
 'BILL_AMT3': 35835,
 'BILL_AMT4': 20940,
 'BILL_AMT5': 19146,
 'BILL_AMT6': 19131,
 'PAY_AMT1': 2000,
 'PAY_AMT2': 36681,
 'PAY_AMT3': 10000,
 'PAY_AMT4': 9000,
 'PAY_AMT5': 689,
 'PAY_AMT6': 679,
 'default payment next month': 0}

In [35]:
client[DATABASE_NAME][COLLECTION_NAME].insert_many(json_data)